In [3]:
import numpy as np
import pandas as pd
df = pd.DataFrame({'key1':['a','a','b','b','a'],'key2':['one','two','one','two','one'],'data1':np.random.randn(5),'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -0.521871 -0.908361
1    a  two  2.809586  0.272774
2    b  one -0.464509  1.676366
3    b  two  1.065455  0.565907
4    a  one -2.108644 -0.161601

In [5]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [6]:
grouped.mean()

key1
a    0.059690
b    0.300473
Name: data1, dtype: float64

In [7]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()
means

key1  key2
a     one    -1.315257
      two     2.809586
b     one    -0.464509
      two     1.065455
Name: data1, dtype: float64

In [8]:
means.unstack()

key2       one       two
key1
a    -1.315257  2.809586
b    -0.464509  1.065455

In [9]:
states = np.array(['Ohio','California','California','Ohio','Ohio'])
years = np.array([2005,2005,2006,2005,2006])

In [10]:
df['data1'].groupby([states,years]).mean()

California  2005    2.809586
            2006   -0.464509
Ohio        2005    0.271792
            2006   -2.108644
Name: data1, dtype: float64

In [11]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.059690 -0.265729
b     0.300473  1.121136

In [12]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one  -1.315257 -0.534981
     two   2.809586  0.272774
b    one  -0.464509  1.676366
     two   1.065455  0.565907

In [13]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [16]:
#对分组进行迭代
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.521871 -0.908361
1    a  two  2.809586  0.272774
4    a  one -2.108644 -0.161601
b
  key1 key2     data1     data2
2    b  one -0.464509  1.676366
3    b  two  1.065455  0.565907

In [17]:
for (k1,k2),group in df.groupby(['key1','key2']):
    print((k1,k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one -0.521871 -0.908361
4    a  one -2.108644 -0.161601
('a', 'two')
  key1 key2     data1     data2
1    a  two  2.809586  0.272774
('b', 'one')
  key1 key2     data1     data2
2    b  one -0.464509  1.676366
('b', 'two')
  key1 key2     data1     data2
3    b  two  1.065455  0.565907

In [20]:
pieces = dict(list(df.groupby('key1')))
pieces['b']

  key1 key2     data1     data2
2    b  one -0.464509  1.676366
3    b  two  1.065455  0.565907

In [22]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [23]:
grouped = df.groupby(df.dtypes,axis=1)

In [24]:
for dtype,group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -0.521871 -0.908361
1  2.809586  0.272774
2 -0.464509  1.676366
3  1.065455  0.565907
4 -2.108644 -0.161601
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [25]:
#选取一列或列的子集